# StructuralSectionRectangularBar Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionRectangularBar Class
Members See Also
---
Defines parameters for Rectangular Bar structural section.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class StructuralSectionRectangularBar : StructuralSectionGeneralF
```

Visual Basic
---
```text
Public Class StructuralSectionRectangularBar _
	Inherits StructuralSectionGeneralF
```

Visual C++
---
```text
public ref class StructuralSectionRectangularBar : public StructuralSectionGeneralF
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralF Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangularBar
# See Also
StructuralSectionRectangularBar Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace